app/views/blogs/_form.html.erb

SELECT "categories".* FROM "categories"
---
                <div class="form-group">
                    <%= f.select :category_id, Category.all.map { |c| [c.category, c.id] }  %>