app/views/blogs/index.html.erb

                            <%= link_to category.category, blogs_path(:cate => category.id) %>
                            <span class="badge badge-primary badge-pill"><%= category.blogs.count %></span>
---
SELECT "blogs".* FROM "blogs"
SELECT COUNT(*) FROM "blogs" WHERE "blogs"."category_id" = ?  [["category_id", 1]]