app/controllers/blogs_controller.rb

  def index
    @categories = Category.all
    cate = params[:cate]
    @blogs = if !cate.nil?
               Blog.where(category_id: cate)
             else
               Blog.all
---
SELECT "categories".* FROM "categories"
SELECT "blogs".* FROM "blogs"

  def show
    @blog = Blog.find(params[:id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def create
    @blog = Blog.create(blog_params)
---
INSERT INTO "blogs" ("title", "content", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?)  [["title", "пизда"], ["content", "хуй"], ["created_at", "2020-12-29 14:49:02.423704"], ["updated_at", "2020-12-29 14:49:02.423704"], ["category_id", 12]]

  def edit
    @blog = Blog.find(params[:id])
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def destroy
    p 'i hate ROR'
    @blog = Blog.find(params[:id])

    @blog.destroy
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 15]]