app/controllers/categories_controller.rb

INSERT INTO "categories" ("category", "created_at", "updated_at") VALUES (?, ?, ?)  [["category", "хуй"], ["created_at", "2020-12-29 14:48:43.180998"], ["updated_at", "2020-12-29 14:48:43.180998"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 12]]
---
  def destroy
    @category.destroy